code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналРегистрацииВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРегистрацииВызовов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Comment>Длительность в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаВызова</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВызова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналРегистрацииВызовов/Ext/ManagerModule.bsl
// Формирует структуру-описание нового вызова
//
// Параметры:
//  ВидВызова	 - Строка - url ресурса, RabbitMQ, строка коннекта ADO
//  ВидДействия	 - Строка - имя web-метода, имя очереди RabbitMQ
// 
// Возвращаемое значение:
//  Структура - содержит параметры, описывающие вызов
//
Функция НовоеОписаниеВызова(ВидВызова, ВидДействия) Экспорт 
	ОписаниеВызова = Новый Структура;
	ОписаниеВызова.Вставить("ДатаВызова", ТекущаяДатаСеанса());
	ОписаниеВызова.Вставить("ВидВызова", ВидВызова);
	ОписаниеВызова.Вставить("ВидДействия", ВидДействия);
	ОписаниеВызова.Вставить("НомерСеанса", НомерСеансаИнформационнойБазы());
	ОписаниеВызова.Вставить("УИД", Новый УникальныйИдентификатор);
	ОписаниеВызова.Вставить("Длительность", 0);
	ОписаниеВызова.Вставить("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	ОписаниеВызова.Вставить("Ошибка", Ложь);
	ОписаниеВызова.Вставить("Обработано", Ложь);
	ОписаниеВызова.Вставить("ОписаниеОшибки", "");
	ОписаниеВызова.Вставить("Комментарий", "");
	ОписаниеВызова.Вставить("ВремяНачала", 0);
	ОписаниеВызова.Вставить("СлужебнаяИнформация", "");
	
	Возврат ОписаниеВызова;
КонецФункции

// Фиксирует в регистре начало вызова
//
// Параметры:
//  ОписаниеВызова	 - Структура - см. НовоеОписаниеВызова()
//  Комментарий		 - Строка - произвольный комментарий
//
Процедура ЗафиксироватьНачало(ОписаниеВызова, Комментарий = "") Экспорт 
	ОписаниеВызова.Комментарий = Комментарий;
	ОписаниеВызова.ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ДобавитьЗапись(ОписаниеВызова);
КонецПроцедуры

// Дополняет параметры описания вызова и вносит запись об успешном окончании вызова в регистр
//
// Параметры:
//  ОписаниеВызова	 - Структура - см. НовоеОписаниеВызова()
//  Комментарий		 - Строка - произвольный комментарий
//
Процедура ЗафиксироватьОкончание(ОписаниеВызова, Комментарий = "") Экспорт 
	Если Не ЗначениеЗаполнено(ОписаниеВызова.Длительность) Тогда 
		ВычислитьДлительность(ОписаниеВызова);
	КонецЕсли;
	
	ОписаниеВызова.Ошибка = Ложь;
	ОписаниеВызова.Обработано = Истина;
	ОписаниеВызова.Комментарий = Комментарий;
	
	ДобавитьЗапись(ОписаниеВызова);
КонецПроцедуры

// Дополняет параметры описания вызова и вносит запись об окончании вызова с ошибкой в регистр
//
// Параметры:
//  ОписаниеВызова	 - Структура - см. НовоеОписаниеВызова()
//  ОписаниеОшибки	 - Строка - подробное описание ошибки
//  Комментарий		 - Строка - произвольный комментарий
//
Процедура ЗафиксироватьОшибку(ОписаниеВызова, ОписаниеОшибки, Комментарий = "") Экспорт 
	Если Не ЗначениеЗаполнено(ОписаниеВызова.Длительность) Тогда 
		ВычислитьДлительность(ОписаниеВызова);
	КонецЕсли;
	
	ОписаниеВызова.Ошибка = Истина;
	ОписаниеВызова.ОписаниеОшибки = ОписаниеОшибки;
	ОписаниеВызова.Обработано = Истина;
	ОписаниеВызова.Комментарий = Комментарий;
	
	ДобавитьЗапись(ОписаниеВызова);
КонецПроцедуры

// Фиксирует в описании вызова его длительность
//
// Параметры:
//  ОписаниеВызова	 - Структура - см. НовоеОписаниеВызова()
//
Процедура ВычислитьДлительность(ОписаниеВызова) Экспорт 
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ОписаниеВызова.Длительность = (ВремяОкончания - ОписаниеВызова.ВремяНачала) / 1000;
КонецПроцедуры

// Добавляет запись в регистр
//
// Параметры:
//  ОписаниеВызова	 - Структура - см. НовоеОписаниеВызова()
//
Процедура ДобавитьЗапись(ОписаниеВызова)
	НаборЗаписей = РегистрыСведений.ЖурналРегистрацииВызовов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДатаВызова.Установить(ОписаниеВызова.ДатаВызова);
	НаборЗаписей.Отбор.ВидВызова.Установить(ОписаниеВызова.ВидВызова);
	НаборЗаписей.Отбор.ВидДействия.Установить(ОписаниеВызова.ВидДействия);
	НаборЗаписей.Отбор.УИД.Установить(ОписаниеВызова.УИД);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ДатаВызова = ОписаниеВызова.ДатаВызова;
	НоваяЗапись.ВидВызова = ОписаниеВызова.ВидВызова;
	НоваяЗапись.ВидДействия = ОписаниеВызова.ВидДействия;
	НоваяЗапись.НомерСеанса = ОписаниеВызова.НомерСеанса;
	НоваяЗапись.УИД = ОписаниеВызова.УИД;
	НоваяЗапись.Длительность = ОписаниеВызова.Длительность;
	НоваяЗапись.Пользователь = ОписаниеВызова.Пользователь;
	НоваяЗапись.Ошибка = ОписаниеВызова.Ошибка;
	НоваяЗапись.Обработано = ОписаниеВызова.Обработано;
	НоваяЗапись.ОписаниеОшибки = ОписаниеВызова.ОписаниеОшибки;
	НоваяЗапись.Комментарий = ОписаниеВызова.Комментарий;
	
	УстановитьПривилегированныйРежим(Истина);
	ФоновоеЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ФоновоеЗадание <> Неопределено Тогда
		НоваяЗапись.СлужебнаяИнформация = ФоновоеЗадание.Наименование + ?(ФоновоеЗадание.РегламентноеЗадание <> Неопределено,
		" (" + ФоновоеЗадание.РегламентноеЗадание.Наименование + ")", "");
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		// логирующие вызовы не должны рушить окружающий функционал, поэтому исключение здесь подавляем
		ЗаписьЖурналаРегистрации("ЖурналРегистрацииВызовов", УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры

// Возвращает отчет по журналу регистрации вызовов
//
// Параметры:
//  НачалоПериода	 - Дата - Начало периода (включая время) выборки данных из ЖРВ
//  ОкончаниеПериода - Дата - Окончания периода (включая время) выборки данных из ЖРВ
//  Уровень			 - Строка - Дополнительное описание для вариантов отбора
//  Заголовок		 - Строка - Заголовок отчета
// 
// Возвращаемое значение:
//   - Табличный документ : данные из регистра, соотвествующие указанным параметрам
//
Функция ОтчетЖРВ(НачалоПериода, ОкончаниеПериода, Уровень = "ТолькоОшибки", Заголовок = "") Экспорт
	
	СКД = РегистрыСведений.ЖурналРегистрацииВызовов.ПолучитьМакет("ОтчетЖРВ");
	
	СКД.Параметры.НачалоПериода.Значение	= НачалоПериода;
	СКД.Параметры.ОкончаниеПериода.Значение	= ОкончаниеПериода;
	
	Если Уровень = "ТолькоОшибки" Тогда
		СписокСостоянийОшибки = Новый СписокЗначений();
		СписокСостоянийОшибки.Добавить(Истина);
		СКД.Параметры.СписокСостоянийОшибки.Значение = СписокСостоянийОшибки;
	КонецЕсли;
	
	Результат = ОбщегоНазначения.РезультатВыполненияСКД(СКД, , , "ТабличныйДокумент", Заголовок);
	ДанныеОтчета = ОбщегоНазначения.ТабличныйДокументВТаблицуЗначений(Результат);
	
	Если ДанныеОтчета.Количество() > 1 Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Подготавливает комментарий по параметрам вызова
//
// Параметры:
//  ПараметрыВызова	 - Структура, Неопределено, ОбъектXDTO
// 
// Возвращаемое значение:
//   - Строка - Параметры вызова строкой и наименование регламентного задания (если вызов через него)
Функция КомментарийОписанияВызова(ПараметрыВызова = Неопределено) Экспорт
	
	ПараметрыДляКомментария = Неопределено;
	
	Если ПараметрыВызова = Неопределено Тогда
		ПараметрыДляКомментария = Новый Структура;
	ИначеЕсли ТипЗнч(ПараметрыВызова) = Тип("ОбъектXDTO") Тогда
		ПараметрыДляКомментария = ОбменДаннымиПереопределяемый.СтруктураИзОбъекта(ПараметрыВызова);
	ИначеЕсли ТипЗнч(ПараметрыВызова) = Тип("Структура") Тогда 
		ПараметрыДляКомментария = ПараметрыВызова;
	Иначе
		Возврат "";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ФоновоеЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ФоновоеЗадание <> Неопределено Тогда
		ПараметрыДляКомментария.Вставить("ФоновоеЗадание", ФоновоеЗадание.Наименование);
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.ПараметрыСтрокой(ПараметрыДляКомментария, ", ", "");

КонецФункции

// Процедура - Отменить регистрацию - удаляет запись о начале вызова в регистре
//
// Параметры:
//  ОписаниеВызова	 - Структура - см. НовоеОписаниеВызова()
//
Процедура ОтменитьРегистрацию(ОписаниеВызова) Экспорт
	УдалитьЗапись(ОписаниеВызова);
КонецПроцедуры

// Удаляет запись из регистра
//
// Параметры:
//  ОписаниеВызова	 - Структура - см. НовоеОписаниеВызова()
//
Процедура УдалитьЗапись(ОписаниеВызова)
	НаборЗаписей = РегистрыСведений.ЖурналРегистрацииВызовов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДатаВызова.Установить(ОписаниеВызова.ДатаВызова);
	НаборЗаписей.Отбор.ВидВызова.Установить(ОписаниеВызова.ВидВызова);
	НаборЗаписей.Отбор.ВидДействия.Установить(ОписаниеВызова.ВидДействия);
	НаборЗаписей.Отбор.УИД.Установить(ОписаниеВызова.УИД);
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		// логирующие вызовы не должны рушить окружающий функционал, поэтому исключение здесь подавляем
		ЗаписьЖурналаРегистрации("ЖурналРегистрацииВызовов", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры
